// . - любой одиночный символ
// [Ii] - любой из них
// [a - f] - диапазоны
// ^ - новая строка
// $ - конец строки
// \ - экранирование
// ^[^t] - начало строки начинающееся не с t
// \d - любые цифры
// \D - всё кроме цифр
// \s - пробел
// \S - всё кроме пробелов
// \w - буква
// \W - всё кроме букв
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 