// . - любой одиночный символ
// [Ii] - любой из них
// [a - f] - диапазоны
// ^ - новая строка
// $ - конец строки
// \ - экранирование
// ^[^t] - начало строки начинающееся не с t
// \d - любые цифры
// \D - всё кроме цифр
// \s - пробел
// \S - всё кроме пробелов
// \w - буква
// \W - всё кроме букв
// \b - граница слова
// \B - не граница слова
// 
// КВАНТИФИКАЦИЯ
// 
// n{4} - искать n подряд 4 раза
// n{4,6} - искать n подряд от 4 до 6
// * - от 0 и выше
// + - от 1цы и выше
// ? - ноль или один
// (\s|-) - группировка
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
// 
//
